# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

n = int(input("число:"))
s = [7, 6, 5, 3, 2, 1]
f = s[-1]
while True:
    if n > s[0]:
        s.insert(0, n)
        break
    elif n > s[-f]:
        f = f + 1
        continue
    elif n <= s[-f]:
        s.insert(-s[::-1].index(f), n)
        break

print(f)
print(s[-f])
print(s)

