# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

n = int(input("введите номер месяца в виде целого числа:"))
s = True
month = ["0", "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь",
         "Декабрь"]
season = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
          10: "Осень", 11: "Осень", 12: "Зима"}

while True:
    if n > 12:
        n = int(input("введите номер месяца от 1 до 12:"))
        continue
    if n <= 0:
        n = int(input("введите номер месяца от 1 до 12:"))
        continue
    else:
        n > 0
        print(month[n], "это", season.get(n))
        break
