# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

e = "дело было вечером делатьбылонечего"
e = e.split()
for ind, el in enumerate(e, 1):
    print(ind, el_10)

